
class Messages:
    START = r"""🔹 ✨ سلام دوست عزیز\! به ربات اینستافایلر خوش اومدی\! 🎉🎊

🚀 با این ربات، می‌تونی خیلی راحت هر محتوایی رو از اینستاگرام دانلود کنی\! 📥📸🎥

🔹 *چطور استفاده کنم؟* 🤔
📌 *پست‌ها \| ریلز ها:* لینک پست اینستاگرام رو 📋 کپی کن و اینجا ارسال کن، ما عکس یا ویدئو هاشو برات می‌فرستیم\! 📤

📌 *استوری‌ها \| هایلایت‌ها \| اطلاعات کاربر \(عکس و\.\.\.\):* فقط کافیه لینک پروفایل یا نام کاربری \(مثلاً: `@instagram`\) رو بفرستی،  
ما استوری‌ها \| هایلایت‌های فعالش رو برات می‌فرستیم\! 🔥📸

"
❗️❗️ *توجه:*  
🔹 این ربات فقط از حساب‌های عمومی \(Public\) یا حساب‌هایی که بهشون دسترسی داری دانلود می‌کنه\!  
💡 برای راهنمایی بیشتر، کافیه دستور `/help` رو ارسال کنی\!
"

❤️ از همراهی شما ممنونیم\! امیدواریم لذت ببری\! 🚀💙"""
    



    JOIN_TO_USE = "لطفا برای استفاده از ربات در چنل های زیر عضو شوید"

    HOW_TO_ADD_A_GROUP = "🔰 برای مدیریت فعال بودن کامنت ها کافیست ربات را در گروه کانال خود ادمین کنید و قابلیت حذف پیام را برای ربات فعال کنید"
    LIST_OF_YOUR_GROUPS = "📄 لیست گروه هایتان را پایین مشاهده می کنید: برای تغییر تنظیمات هر کدام کافیست روی آن کلیک کنید"
    NO_GROUPS = " ❌ شما این ربات را در هیچ گروهی ادمین نکرده اید"
    COMMENT_WAS_ACTIVATED:str = "کامنت های گروه {}  با موفقیت فعال✅ شد"
    COMMENT_WAS_DEACTIVATED:str = "کامنت های گروه {} با موفقیت غیر فعال❌ شد"

    GROUP_SETTING:str = "⚜️ برای تغییر تنظیمات گروه {} از دکمه های زیر استفاده کنید."
    GROUP_REMOVED:str = "✅ گروه {} با موفقیت از لیست گروه های شما حذف شد"
    CHANNEL_REMOVED:str = "✅ کانال {} با موفقیت از لیست کانال های شما حذف شد"
    BOT_SUCCESSFULLY_ADDED_TO_GROUP = '✅ گروه {} با موفقیت به گروه های شما اضافه شد.'
    BOT_SUCCESSFULLY_ADDED_TO_CHANNEL = '✅ کانال {} با موفقیت به کانال های شما اضافه شد.'
    CHANNEL_INFO = """
نام: {}
ای دی: {}
ادمین: {}
گزارش گیری از ممبر های کانال: {}
"""

    USER_TRIED_TO_ADD_BOT_TO_GROUP:str = "کاربری با نام {} ربات را به گروه {} اضافه کرد"
    USER_TRIED_TO_ADD_BOT_TO_CHANNEL:str = "کاربری با نام {} ربات را به کانال {} اضافه کرد"

    YOU_CANT_USE_THIS_BOT = """💠 سلام! در حال حاضر این ربات عضویت در گروه/چنل ها را نمی پذیرد
"""
    SEND_YOUR_MESSAGE = """🤖 لطفا برای تنظیم پیام💬 برای گروه {}. پیام خود را همین پایین ارسال کنید.
پیام ارسالی در بخش نظرات هر پست به عنوان کامنت اول ارسال خواهد شد
برای حذف پیام کانال درخواست زیر را ارسال کنید:
/delete_message
 """

    SUCCESSFULLY_SET_YOUR_GROUP_MESSAGE = "✅ پیام گروه شما با موفقیت ثبت شد. این پیام به عنوان اولین کامنت زیر پست ها ارسال خواهد شد"
    SUCCESSFULLY_DELETED_YOUR_GROUP_MESSAGE = "✅پیام مربوط به گروه شما با موفقیت حذف❌ شد. "

    THIS_IS_HOW_TO_ADD_ADMIN = "🔰 برای افزودن ادمین جدید ➕کافیست یک پیام از ادمین مورد نظر اینجا فوروارد کنید (اگه فوروارد نباشه ربات کار نمیکنه)"
    ADMIN_WAS_SUCCESSFULLY_ADDED = "✅ ادمین مورد نظر با موفقیت اضافه شد"

    THIS_IS_THE_LIST_OF_ADMINS = """📄 لیست ادمین ها را پایین مشاهده می کنید برای حذف هر کدام می توانید
❌ برای حذف هر کدام میتوانید روی اسم آنها کلیک کنید
    """ 
    YOU_HAVE_NO_ADMINS = "🛑 شما در حال حاضر هیچ ادمینی اضافه نکرده اید"
    ADMIN_WAS_REMOVED = "✅ ادمین مد نظر با موفقیت از لیست ادمین ها حذف شد"

    LEFT_THE_CHAT = "ربات با موفقیت از گروه خارج شد"




    #### admin panel(AP) #################
    HI_ADMIN = "سلام ادمین {}. از کیبورد استفاده کن"
  
    AP_STATS = """
Non-Accepter users
📊 User Statistics
👥 Total Users: {}
📅 Users Today: {}
📆 Users Yesterday: {}
🆕 Users in Last 7 Days: {}
📆 Users in Last 30 Days: {}
📆 Users from 30 to 60 Days Ago: {}
▪️➖➖➖➖➖➖➖➖➖
Accepter users:
👥 Total Users: {}
👥 Total Users[started]: {}
📅 Users Today: {}
📅 Users Today[started]: {}
📆 Users Yesterday: {}
🆕 Users in Last 7 Days: {}
📆 Users in Last 30 Days: {}
📆 Users from 30 to 60 Days Ago: {}
▪️➖➖➖➖➖➖➖➖➖
کسایی که ربات را بلاک کردند: {}
▪️➖➖➖➖➖➖➖➖➖
میزان جوین اجباری در کانال های قفل: 
امروز: {}
دیروز: {}
▪️➖➖➖➖➖➖➖➖➖
❤️‍🔥 تعداد افرادی که در 24 ساعت اخیر از ربات استفاده کرده اند: {}
🙏 درخواست کننده های منحصر به فرد:
📍 {}
📍 {} 
📍 {} 
💡 کاربر تازه نفسی(عضویت در 24 ساعت اخیر) که به ربات درخواست داده: {}
▪️➖➖➖➖➖➖➖➖➖
📥 تعداد کل درخواست ها: {} درخواست
▪️➖➖➖➖➖➖➖➖➖
💠 وضعیت ربات: {} ✅
"""


    FORCED_ORDER_INFO = """
📢 <b>جزئیات سفارش عضویت اجباری</b> 📢

🆔 <b>شناسه کانال:</b> <code>{}</code>
🔹 <b>عنوان:</b> <code>{}</code>
🔗 <b>لینک دعوت:</b> <a href="{}">کلیک کنید</a>

📌 <b>وضعیت سفارش:</b>
✔️ <b>ثابت:</b> <code>{}</code>
🛑 <b>فیک فورس:</b> <code>{}</code>
🔄 <b>وضعیت تکمیل:</b> <code>{}</code>

📊 <b>پیشرفت سفارش:</b>
👥 <b>تعداد اعضای سفارش‌شده:</b> <code>{}</code>
"""

    ORDER_STATS = """🫂 سفارش جوین اجباری:

🔗 لینک: {}
🛒 تعداد اعضای سفارش: {}
✅ مقدار انجام شده: {}
📊 باقی مانده: {}
{} وضعیت تکمیل: {}

🟩 تعداد افراد عضو شده از لینک: {}
🟥 تعداد افراد لفت داده: {}"""


    ORDER_TRACKING_EXPLANATION = """⚙️ لطفا نوع پیگیری ربات برای عضویت اعضا در کانال را با مشخص کنید.

1️⃣ اگر عدد ◀️<b> 0 </b>▶️ را ارسال کنید عضویت در اعضا از لینک در چنل پیگیری نمی شود.
2️⃣ اگر هر عددی بیشتر از صفر ارسال کنید وقتی تعداد عضویت اعضا در کانال به آن عدد رسید لینک به طور خودکار غیرفعال می شود"""
    SET_A_VALID_NUMBER_FOR_ORDER_TRACKING = " ❌ لطفا یک عدد معتبر را برای تعداد عضویت سفارش را وارد کنید. نمونه ✅ 0 (عدم پیگیری توسط ربات)  ✅ 540  ✅ 1000"
    
    SEND_A_MESSAGE_FROM_CHANNEL = """🌝 چیزی نمونده!

1️⃣ یک پیام از چنل اینجا فوروارد کن تا چنل تو دیتابیس اضافه شه انجام بشه
2️⃣ بعد اون از نو همون پیامو ارسال کن تا ثبت نهایی انجام شه
"""
    ORDER_WAS_CREATED = "✅ سفارش عضویت اجباری/فیک با موفقیت ایجاد شد"


    SUBSCRIPTION_PLAN_INFO = """<b>🎉 پلن های اشتراک</b>
    
🔹 <b>نام پلن:</b> {}  
⚡ <b>محدودیت درخواست در ثانیه:</b> {}  
👀 <b>مشاهده پیوستن اجباری:</b> {}  
⭐ <b>پلن پیش‌فرض:</b> {}  
🔽 <b>قابلیت دانلود:</b> {}  
"""

    API_ERROR = "محتوای مورد نظر شما دانلود نشد! آیا مطمئنید لینک ارسال سالم و کانال مد نظر پابلیک است؟ اگه این شرایط صدق میکنه از نو امتحان کنید"

    HERES_YOUR_FILE = """✅ فایل مد نظر شما آماده است:
تعداد [{}]"""
    HERES_YOUR_STORY = "✅ استوری مد نظر شما آماده است:"
    HERES_YOUR_STORIES = """✅  استوری های فعال کاربر آماده است.
تعداد [{}]"""
    HERES_HIGHTLIGHT_STORIES = """✅ استوری های این هایلایت آماده است:
تعداد [{}]
      """


    API_STATISTICS = """<b>📊 آمار روزانه و ماهانه</b>

<b>📅 امروز:</b>
- 📥 درخواست‌های اینستاگرام: <code>{}</code>
- 🌐 درخواست‌های API: <code>{}</code>
- 🗄 پاسخ‌های کش شده: <code>{}</code>
- 🔹 درخواست‌های ONE API: <code>{}</code>
- 🔸 درخواست‌های FastSaver API: <code>{}</code>

<b>📆 دیروز:</b>
- 📥 درخواست‌های اینستاگرام: <code>{}</code>
- 🌐 درخواست‌های API: <code>{}</code>
- 🗄 پاسخ‌های کش شده: <code>{}</code>
- 🔹 درخواست‌های ONE API: <code>{}</code>
- 🔸 درخواست‌های FastSaver API: <code>{}</code>

<b>📈 ۳۰ روز گذشته:</b>
- 📥 درخواست‌های اینستاگرام: <code>{}</code>
- 🌐 درخواست‌های API: <code>{}</code>
- 🗄 پاسخ‌های کش شده: <code>{}</code>
- 🔹 درخواست‌های ONE API: <code>{}</code>
- 🔸 درخواست‌های FastSaver API: <code>{}</code>

<i>بروزرسانی خودکار.</i>
"""
    
    API_HEALTH = """📊 <b>گزارش وضعیت API</b>

🕒 <b>24 ساعت گذشته:</b>
🔹 تعداد کل درخواست‌ها: <code>{}</code>
🔹 درخواست‌های موفق: <code>{}</code>
🔹 نرخ موفقیت: <code>{:.2f}%</code>

🌍 <b>API ONE:</b>
🔹 درخواست‌ها: <code>{}</code>
🔹 موفقیت‌ها: <code>{}</code>
🔹 نرخ موفقیت: <code>{:.2f}%</code>

⚡ <b>FastSaver API:</b>
🔹 درخواست‌ها: <code>{}</code>
🔹 موفقیت‌ها: <code>{}</code>
🔹 نرخ موفقیت: <code>{:.2f}%</code>

📅 <b>30 روز گذشته:</b>
🔹 تعداد کل درخواست‌ها: <code>{}</code>
🔹 درخواست‌های موفق: <code>{}</code>
🔹 نرخ موفقیت: <code>{:.2f}%</code>

🌍 <b>API ONE:</b>
🔹 درخواست‌ها: <code>{}</code>
🔹 موفقیت‌ها: <code>{}</code>
🔹 نرخ موفقیت: <code>{:.2f}%</code>

⚡ <b>FastSaver API:</b>
🔹 درخواست‌ها: <code>{}</code>
🔹 موفقیت‌ها: <code>{}</code>
🔹 نرخ موفقیت: <code>{:.2f}%</code>
"""
    

    THE_ACCOUNT_IS_PRIVATE = """✨❌ به دلیل خصوصی بودن اکانت مد نظر، متاسفانه امکان انجام درخواست شما وجود ندارد! 🔒🚫

اگه شخص مد نظر اکانت عمومی داره اونو بفرست برام 😊👍"""

    LIST_OF_BROADCASTS = """👤 لیست ارسال های همگانی

🔝 در حال ارسال
✅تکمیل شده 
⏸️ متوقف شده/شروع نشده"""

    BROADCAST_INFO = """ℹ️ اطلاعات ارسال همگانی

🆔 آی دی: {}
⌛️ تعداد ارسال بر دقیقه: {} عدد
✅ ارسال های موفق: {} نفر
🤙 افراد پوشش داده شده: {} نفر
🗣 ارسال برای: {} نفر

⬆️ در حال ارسال؟: {}
🏁 پایان یافته؟: {}"""


    ARE_YOU_SURE_YOU_WANNA_DELETE_CHANNEL = """آیا مطمئنید میخواید چنل {} را از ربات حذف کنید؟
- ربات از چنل لفت میدهد
- کلیه اطلاعات چنل از ربات حذف می شود
- لینک های اکسپتر چنل از کار می افتد
- آمارگیری جوین و لفت از لینک های ساخت ربات متوقف می شود"""



    BALANCE_MANAGING_TIPS = """📊 موجودی حساب شما بر اساس قواعد زیر تغییر می کند

1️⃣🟥 هر دانلود از اینستاگرام {} سکه کاهش
2️⃣🟩 هر زیرمجموعه {} سکه افزایش
3️⃣🟩 هر روز جدیدی که درخواست دانلود به ربات می فرستید {} سکه افزایش

✅ هر الماس معادل {} سکه می باشد. در صورت تماس شدن سکه ها به طور اتوماتیک مقداری از الماس ها به سکه تبدیل می شوند."""